# ResList_AddCont1

## Description
Adds a content lcoation. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_AddCont1(
				uniqueID       : STRING;
				baseFolderSpec : INTEGER;
				folderName     : DYNARRAY[] of CHAR);
```

```python

def vs.ResList_AddCont1(uniqueID, baseFolderSpec, folderName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||
|baseFolderSpec|INTEGER||
|folderName|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2017
## Category
* Document List Handling